app/controllers/upload_images_controller.rb

  def crop
    @inplace_image = InplaceImage.find(params["id"])
    @inplace_image.crop_options= {
            :style_to_crop => params["inplace_image"]["sub_type_name"],
            :crop_geometry => ActiveSupport::JSON.decode(params["inplace_image"][:crop_geometry])
    }

    @inplace_image.save
---
UPDATE "inplace_images" SET "upload_params" = NULL WHERE "id" = 4