app/controllers/upload_images_controller.rb

  def upload_new
    #  имитируем передачу через url ибо лень писать разные формы :alias=>params[:alias]
    @inplace_image = InplaceImage.new(params["inplace_image"].merge({:alias=>params[:alias]}))
    unless  @inplace_image.save
---
INSERT INTO "inplace_images" ("data_updated_at", "updated_at", "data_file_name", "data_content_type", "data_file_size", "geometry_type", "upload_params", "alias", "created_at") VALUES('2009-09-28 11:52:28.406000', '2009-09-28 11:52:28.625000', E'map.jpg', E'image/jpeg', 57753, E'mainpage', NULL, E'mainpage_crop', '2009-09-28 11:52:28.625000') RETURNING "id"

  def crop
    return render(:text=>{:error=>"no sub_type_name"}.to_json,:status=>:failed) if params["inplace_image"]["sub_type_name"].blank?
    @inplace_image = InplaceImage.find(params["id"])
---
SELECT * FROM "inplace_images" WHERE ("inplace_images"."id" = 4)

  def reupload_image
    @inplace_image = InplaceImage.find(params["id"])
    @inplace_image.attributes.merge!(params["inplace_image"].merge({:alias=>params[:alias]}))
    @inplace_image.data = params["inplace_image"]['data']

    Configuration.image_types[@inplace_image.geometry_type].each do |style|
      @inplace_image.data.add_style({:"#{style["name"]}" => "#{style["width"]}x#{style['height']}"})
    end

    unless  @inplace_image.save
---
SELECT * FROM "inplace_images" WHERE ("inplace_images"."id" = 2)
UPDATE "inplace_images" SET "data_updated_at" = '2009-09-23 12:51:52.734000', "upload_params" = NULL, "data_file_size" = 30803, "data_file_name" = E'jackson.jpg', "updated_at" = '2009-09-23 12:51:52.765000' WHERE "id" = 2

  def show
    @inplace_image = InplaceImage.find(params["id"])
---
SELECT * FROM "inplace_images" WHERE ("inplace_images"."id" = 2)

  def test_crop
    @inplace_image = InplaceImage.find(params["id"])
---
SELECT * FROM "inplace_images" WHERE ("inplace_images"."id" = 4)